import json
import datetime
print(datetime.datetime.utcnow())
a ='''{
"data":[
"Тема 1: Понимание B2B продаж и его нюансов в сфере торговли чаем",
"Тема 2: Исследование рынка кафе и ресторанов",
"Тема 3: Управление командой для достижения цели - повышение продаж",
"Тема 4: Управление отношениями с клиентами в B2B сфере",
"Тема 5: Разработка и реализация стратегии продаж чая для кафе и ресторанов",
"Тема 6: Анализ поведения потребителей в B2B сегменте",
"Тема 7: Разработка уникального торгового предложения для повышения продаж",
"Тема 8: Практические методы для преодоления низких продаж",
"Тема 9: Разработка эффективной системы управления продажами в B2B",
"Тема 10: Управление стоимостью продукта и его влияние на продажи",
"Тема 11: Техники управления рисками в B2B продажах",
"Тема 12: Методы привлечения новых клиентов в сфере кафе и ресторанов",
"Тема 13: Тактики переговоров с B2B клиентами",
"Тема 14: Использование аналитических инструментов для повышения продаж",
"Тема 15: Стратегии для повышения уровня удовлетворенности клиентов",
"Тема 16: Перспективы и тренды рынка чая в сфере кафе и ресторанов",
"Тема 17: Понимание и управление внутренними процессами, влияющими на продажи",
"Тема 18: Разработка и внедрение стратегии продаж на основе исследования конкурентов",
"Тема 19: Методы определения и достижения целевых показателей продаж",
"Тема 20: Стратегии ретенции и удержания клиентов в B2B",
"Тема 21: Расширение бизнеса: исследование новых ниш и возможностей"
]
}'''

# test_obj = json.loads(a)
# for i in range(21):
#     print(test_obj["data"][i])
    

