
bot_messages = {
    "start1": "Здравствуйте, я Ваш персональный тренер компетенций. "
"Рад, что Вы приняли решение начать обучаться и развивать свои профессиональные навыки. "
"Инвестиции в себя одни из самых окупаемых.",
    "start2": "Обучение будет проходить 21 день, каждый день Вы будете получать учебные материалы в соответствии с планом, "
"которые будут состоять из коротких фокусных модулей, включающих в себя теоретические знания, практические советы, "
"методы и методики эффективного применения знаний на практике, задания для внедрения практик в рабочие процессы, "
"разборы примеров из реальной жизни, изучение успешных и неуспешных практик. "
"Завершаться каждый модуль будет вопросами для проведения рефлексии и постановки целей на будущее. ",
    "start3": "Подробнее о том, как проходить каждый этап обучения можно узнать позже перейдя по кнопке в меню “Об обучении”.",
    "start4": "План обучения разрабатывается исключительно под Ваши бизнес-задачи и основывается на программе диагностики. "
"Пожалуйста, выделите время для ее прохождения чтобы впоследствии получать персональные материалы без воды и лишней траты времени."
}
